MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/inc/hc32f46x_pwc.h
    /*******************************************************************************
     * Global variable definitions ('extern')
     ******************************************************************************/

    /*******************************************************************************
     * Global function prototypes (definition in C source)
     ******************************************************************************/
    void PWC_PowerModeCfg(const stc_pwc_pwr_mode_cfg_t *pstcPwrMdCfg);
    void PWC_EnterPowerDownMd(void);

    void PWC_PdWakeup0Cmd(uint32_t u32Wkup0Event, en_functional_state_t enNewState);
    void PWC_PdWakeup1Cmd(uint32_t u32Wkup1Event, en_functional_state_t enNewState);
    void PWC_PdWakeup2Cmd(uint32_t u32Wkup2Event, en_functional_state_t enNewState);
    void PWC_PdWkupEdgeCfg(const stc_pwc_wkup_edge_cfg_t *pstcWkupEdgeCfg);

    en_flag_status_t PWC_GetWakeup0Flag(uint8_t u8WkupFlag);
    en_flag_status_t PWC_GetWakeup1Flag(uint8_t u8WkupFlag);
    void PWC_ClearWakeup0Flag(uint8_t u8WkupFlag);
    void PWC_ClearWakeup1Flag(uint8_t u8WkupFlag);
    void PWC_PwrMonitorCmd(en_functional_state_t enNewState);

    void PWC_Fcg0PeriphClockCmd(uint32_t u32Fcg0Periph, en_functional_state_t enNewState);
    void PWC_Fcg1PeriphClockCmd(uint32_t u32Fcg1Periph, en_functional_state_t enNewState);
    void PWC_Fcg2PeriphClockCmd(uint32_t u32Fcg2Periph, en_functional_state_t enNewState);
    void PWC_Fcg3PeriphClockCmd(uint32_t u32Fcg3Periph, en_functional_state_t enNewState);

    en_result_t PWC_StopModeCfg(const stc_pwc_stop_mode_cfg_t *pstcStpMdCfg);
    void PWC_StopWkupCmd(uint32_t u32Wkup0Event, en_functional_state_t enNewState);

    void PWC_EnterStopMd(void);
    void PWC_EnterSleepMd(void);

    void PWC_RamCfg(const stc_pwc_ram_cfg_t *pstcRamCfg);
    void PWC_Xtal32CsCmd(en_functional_state_t enNewState);
    void PWC_WktmControl(const stc_pwc_wktm_ctl_t *pstcWktmCtl);

    void PWC_PvdCfg(const stc_pwc_pvd_cfg_t *pstcPvdCfg);
    void PWC_Pvd1Cmd(en_functional_state_t enNewState);
    void PWC_Pvd2Cmd(en_functional_state_t enNewState);
    void PWC_ExVccCmd(en_functional_state_t enNewState);
    en_flag_status_t PWC_GetPvdFlag(en_pwc_pvd_flag_t enPvdFlag);

    void PWC_HrcPwrCmd(en_functional_state_t enNewState);
    void PWC_PllPwrCmd(en_functional_state_t enNewState);

    void PWC_IrqClkBackup(void);
    void PWC_IrqClkRecover(void);
    void set_vcap(void);

    //@} // PwcGroup

#ifdef __cplusplus
}
#endif

#endif /* DDL_PWC_ENABLE */

#endif /* __HC32F46X_PWC_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
